
// let host="http://127.0.0.1:3000"
let host="https://trappyuchi.herokuapp.com"
let search_data=[
    {type:'類型 ▼',selected:true},
    {type:'餐廳',selected:false},
    {type:'景點',selected:false},
    {type:'飯店',selected:false},
    {type:'文章',selected:false},
    {type:'活動',selected:false},
    ]

let photo_list=[
        {index:1,src:'https://picsum.photos/960/500?random=1'},
        {index:2,src:'https://picsum.photos/960/500?random=2'},
        {index:5,src:'https://picsum.photos/960/500?random=3'},
        {index:4,src:'https://picsum.photos/960/500?random=4'},
        {index:5,src:'https://picsum.photos/960/500?random=5'},      
    ]

let css={
    black_block:{display:false},
    top_anno:{display:false},
    signin:{display:false}
}

let main_nav=[
    {name:"帳戶",href:"javascript:void(0)",action:"open_acc_window"},
    {name:"行程",href:"javascript:void(0)",action:"open_acc_window"},
    {name:"聊天",href:"javascript:void(0)",action:"open_acc_window"},
    {name:"通知",href:"javascript:void(0)",action:"open_acc_window"},
    {name:"下載",href:"javascript:void(0)",action:"open_acc_window"},
    {name:"關於我們",href:"javascript:void(0)",action:"open_acc_window"},
]

let test_article={
    post:{
        hot:{
            end_state:true,
            view_count:3,
            title:"熱門文章",
            source:[
                {src:"https://picsum.photos/400/250?random=74",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=75",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=67",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=77",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=87",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=74",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=745",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=647",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=747",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=487",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
            ]
        },
        new:{
            end_state:true,
            view_count:3,
            title:"最新文章",
            source:[
                {src:"https://picsum.photos/400/250?random=471",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=571",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=671",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=771",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=871",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=471",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=571",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=6781",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=7781",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=8791",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=4781",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=5731",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=6771",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=7741",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=8721",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
            ]
        }
    },
    activity:{
        hot:{
            end_state:true,
            view_count:3,
            title:"熱門活動",
            source:[
                {src:"https://picsum.photos/400/250?random=14",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=15",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=16",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=17",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=18",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=14",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=15",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=16",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=17",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=18",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=14",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=15",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=16",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=17",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=18",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
            ]
        },
        new:{
            end_state:true,
            view_count:3,
            title:"最新活動",
            source:[
                {src:"https://picsum.photos/400/250?random=24",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=25",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=26",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=27",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=28",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=24",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=25",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=26",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=27",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=28",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=24",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=25",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=26",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=27",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
                {src:"https://picsum.photos/400/250?random=28",title:"追求小學，新型暫無百度能夠所說印刷面對，理由程度大家都",content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。"},
            ]
        }
    },
    view:{
        hot:{
            end_state:true,
            view_count:4,
            title:"熱門景點",
            source:[
                {src:"https://picsum.photos/400/250?random=14",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=24",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=34",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=154",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=144",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=184",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=14",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=24",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=34",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=154",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=144",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=184",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=14",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=24",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=34",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=154",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=144",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                {src:"https://picsum.photos/400/250?random=184",title:"追求小學，新型暫無百度能夠所說印刷面對"},
            ]
        },
        new:{
            end_state:true,
            view_count:4,
            title:"最新景點",
            source:[
                // {src:"https://picsum.photos/400/250?random=144",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=264",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=344",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1454",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1454",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1844",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=144",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=264",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=344",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1454",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1454",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1844",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=144",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=264",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=344",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1454",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1454",title:"追求小學，新型暫無百度能夠所說印刷面對"},
                // {src:"https://picsum.photos/400/250?random=1844",title:"追求小學，新型暫無百度能夠所說印刷面對"},
            ]
        }
    },
    resta:{
        hot:{
            end_state:true,
            view_count:3,
            title:"熱門餐廳",
            source:[
                {
                    src:"https://picsum.photos/400/250?random=74",
                    title:"龍潭豆花",
                    address:"臺東縣962長濱鄉三間村水母丁1-9號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
                {
                    src:"https://picsum.photos/400/250?random=155",
                    title:"望海巴耐餐廳/咖啡",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
                {
                    src:"https://picsum.photos/400/250?random=146",
                    title:"噶瑪蘭海產店",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
                {
                    src:"https://picsum.photos/400/250?random=1546",
                    title:"噶瑪蘭海產店",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },                
                {
                    src:"https://picsum.photos/400/250?random=1476",
                    title:"噶瑪蘭海產店",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
            ]
        },
        new:{
            end_state:true,
            view_count:3,
            title:"最新餐廳",
            source:[
                {
                    src:"https://picsum.photos/400/250?random=774",
                    title:"龍潭豆花",
                    address:"臺東縣962長濱鄉三間村水母丁1-9號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
                {
                    src:"https://picsum.photos/400/250?random=1455",
                    title:"望海巴耐餐廳/咖啡",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
                {
                    src:"https://picsum.photos/400/250?random=246",
                    title:"噶瑪蘭海產店",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
                {
                    src:"https://picsum.photos/400/250?random=446",
                    title:"噶瑪蘭海產店",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },                
                {
                    src:"https://picsum.photos/400/250?random=546",
                    title:"噶瑪蘭海產店",
                    address:"臺東縣962長濱鄉寧埔村烏石鼻14鄰41-3號",
                    content:"地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。地方整體結合你能漸漸清晰會議，現在例如關注實驗依舊持續不久品牌我想，就不威脅自己外觀我又無人掌握相。",
                    phone: "10:30–19:00",
                },
            ]
        }
    },
    hotel:{
        hot:
        {
            end_state:true,
            view_count:3,
            title:"熱門飯店",
            source:[
                {src:'https://picsum.photos/300/400?random=234',title:"天野1飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=143',title:"天野2飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=14',title:"天野3飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=243',title:"天野4飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=143',title:"天野5飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=41',title:"天野6飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=4143',title:"天野7飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=144',title:"天野8飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=2443',title:"天野1飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=414344',title:"天野2飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=144',title:"天野3飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=2443',title:"天野4飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=41443',title:"天野5飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=144',title:"天野6飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=4413',title:"天野7飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
            ],
        },
        new:
        {
            end_state:true,
            view_count:3,
            title:"最新飯店",
            source:[
                {src:'https://picsum.photos/300/400?random=23',title:"天野1飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=13',title:"天野2飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=1',title:"天野3飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=23',title:"天野4飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=13',title:"天野5飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=1',title:"天野6飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=143',title:"天野7飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=14',title:"天野8飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=243',title:"天野1飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=134',title:"天野2飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=14',title:"天野3飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=243',title:"天野4飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像⭐"},
                {src:'https://picsum.photos/300/400?random=143',title:"天野5飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=14',title:"天野6飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
                {src:'https://picsum.photos/300/400?random=413',title:"天野7飯店",description:"築風格是樂窩金門民宿給人視覺驚喜的第一印象，布丁色的橘牆披上黑糖色的咖啡腰帶，像極了布丁的造型就是這麼的特別，距離海灘只有650公尺的距離配合季節海風的吹撫，更讓視覺因此難以轉移，在這建築裡，有我們精心的塑造，樸素的風格、讓年輕活力的主題塑造到您的期待想像"},
            ],
        }
    }
}






Vue.component("article_page",{
    data:function(){
        return {test_article:test_article[this.subclass][this.subname]}
    },
    props:["subname","subclass"],
    template:
    `<div class="sect">
        <ul class="post">
            <p class="title">{{test_article.title}}</p>
            <li v-for="(item,key) in test_article.source" v-show="key<test_article.view_count" >
                <img :src=item.src  onerror="this.src='https://picsum.photos/400/250?random=487'" alt="">
                <div class="text">
                    <div class='title'>{{item.title}} </div>
                    <div class='content'>{{item.content}}</div>
                    <div class="comment">
                        <i class="fas fa-chart-line"></i><span>2808</span>
                        <i class="fas fa-heart"></i><span>2808</span>
                    </div>
                </div>
            </li>
            
            <li class="none_box" v-show="test_article.end_state" @click="more_count" ><a class="morSe_btn" href="javascript:void(0)">查看更多</a></li>
        </ul>
    </div>
    `,    
    methods:{
        more_count(){
            this.test_article.view_count+=3
            if(this.test_article.view_count>=this.test_article.source.length)
                this.test_article.end_state=false
        }
    }
})




Vue.component("view_page",{
    data:function(){
        return {test_article:{}}
    },
    props:["subname","subclass"],
    template:`
        <div class="sect">
            <p class="title">{{test_article.title}}</p>
            <ul class="view">
                <li v-for="(item,key) in test_article.source" v-show="key<test_article.view_count" ><img :src="item.src" onerror="this.src='https://picsum.photos/400/250?random=487'"><span>{{item.title}}</span></li>
                <li class="none_box" v-show="test_article.end_state" @click="more_count" ><a class="morSe_btn" href="javascript:void(0)">查看更多</a></li>
            </ul>
        </div>
    `,
    mounted:function(){
        let loading_count=20
        let title=this.subname==="hot"?"熱門景點":"最新景點"
        axios.get(host+'/api/attractions').then((res)=>{
            view={
                end_state:true,
                view_count:4,
                title:title,
                source:[]
            }
            for(let i=0;i<loading_count;i++){
                view["source"].push({
                    "src":res.data[i].Atphoto,
                    "title":res.data[i].Atname
                })
            }
            this.test_article=view    
        }) 
    },
    methods:{
        more_count(){
            this.test_article.view_count+=4
            if(this.test_article.view_count>=this.test_article.source.length)
                this.test_article.end_state=false
        }
        
    }
})


Vue.component("resta_page",{
    data:function(){
        return {test_article:{}}
    },
    props:["subname","subclass"],
    template:`
        <div class="sect">
            <p class="title">{{test_article.title}}</p>
            <ul class="resta">
                <li class="content" v-for="(item,key) in test_article.source" v-show="key<test_article.view_count">
                    <div class="t_group">
                        <p class="idx">{{key+1}}</p>
                        <p class="title">{{item.title}}</p>
                    </div>
                    <img :src='item.src' onerror="this.src='https://picsum.photos/400/250?random=487'">
                    <p class="text">{{item.content}}</p>
                    <p class="address"><span>位置資訊：</span>{{item.address}}</p>
                    <p class="worktime"><span>營業時間：</span>{{item.phone}}</p>
                </li>
                <li class="none_box" v-show="test_article.end_state" @click="more_count" ><a class="morSe_btn" href="javascript:void(0)">查看更多</a></li>
            </ul>
        </div>
    `,
    mounted:function(){
        let loading_count=30
        let title=this.subname==="hot"?"熱門餐廳":"最新餐廳"
        axios.get(host+'/api/restaurants').then((res)=>{
            data={
                end_state:true,
                view_count:8,
                title:title,
                source:[]
            }
            for(let i=0;i<loading_count;i++){
                data["source"].push({
                    "src":res.data[i].Rphoto,
                    "title":res.data[i].Rname,
                    "content":res.data[i].Rdescription,
                    "phone":res.data[i].Rphone,
                    "address":res.data[i].Raddress
                })
            }
            this.test_article=data
        })
    },
    methods:{
        more_count(){
            this.test_article.view_count+=3
            if(this.test_article.view_count>=this.test_article.source.length)
                this.test_article.end_state=false
        }
    }
})

let len=Math.ceil(test_article.hotel.hot.source.length/3)
Vue.component("hotel_page",{
    data:function(){
        return {test_article:{},
                span:846,now_index:0,len}
    },
    props:["subname","subclass"],
    computed:{
        computed_left(){
            return {
                "left":(-this.now_index*this.span)+"px",
            }
        }
    },
    template:
    `   <div class="sect">
        <p class="title">{{test_article.title}}</p>
        <div class="ranbo">
            <div class="btn_left" @click="delta(-1)"></div>
            <div class="pic">
                <ul class="nav" :style="computed_left">
                    <li v-for="temp in test_article.source">
                        <img :src="temp.src" alt="">
                        <div class="info">
                            <p class="title">{{temp.title}}</p>
                            <p class="rate">{{temp.description}}</p>
                        </div>
                    </li>
                </ul>
            </div>
            <div class="btn_right" @click="delta(1)"></div>
        </div>
    </div>`,
    mounted:function(){
        let loading_count=10
        let title=this.subname==="hot"?"熱門飯店":"最新飯店"
        axios.get(host+"/api/hotels").then((res)=>{
            data={
                end_state:true,
                view_count:8,
                title:title,
                source:[]
            }
            for(let i=0;i<loading_count;i++){
                if (res.data[i].Hdescription.length>100){
                    res.data[i].Hdescription=res.data[i].Hdescription.slice(0,100)+"..."
                }
                data["source"].push({
                    "src":res.data[i].Hphoto,
                    "title":res.data[i].Hname,
                    "description":res.data[i].Hdescription,
                    "phone":res.data[i].Hphone,
                    "address":res.data[i].Haddress
                })
            }
            this.test_article=data
        })
    },
    methods:{
        more_count(){
            this.test_article.view_count+=3
            if(this.test_article.view_count>=this.test_article.source.length)
                this.test_article.end_state=false
        },
        delta(d){
            this.now_index=(this.now_index+d+len)%len;
        }
    }
})

let sub_tab="article"

let subnav={
    "article":{cht:"文章",state:false},
    "activity":{cht:"活動",state:false },
    "view":{cht:"景點",state:false},
    "resta":{cht:"餐廳",state:false},
    "hotel":{cht:"飯店",state:false}
}
let p_data={
    acc:"",
    pwd:""
}

let vm=new Vue({
    el:"#app",
    data:{p_data,index:1,search_data,photo_list,css,sub_tab,subnav},
    computed:{/*即刻運算*/
        selected(){
            new_arr=this.search_data.forEach(function(item,index,array){
                if(item.selected==true && array[0]!=item){
                    array[0]= Object.assign({},item)
                    array[0].type=array[0].type+" ▼"
                }
            })
            return this.search_data
        },
    },
    mounted(){
        this.intervalId = setInterval(this.scroll, 5000)
    },
    methods:{/*方法*/
        scroll(){
            setTimeout(() => {this.index=(this.index+1)%4}, 1000)
        },
         // 間隔時間後重復執行
        select_item(event){
            let tar=event.target.innerText;
            this.search_data.forEach((item,index) => {
                if(item.type==tar){
                    item.selected=true
                }else{
                    item.selected=false
                }
            })
            console.log(event.target.innerText)
            return event.target.innerText
        },
        open_travel_window(){
            css.black_block.display=true
            css.top_anno.display=true
        },
        close_other(){
            css.black_block.display=false
            css.top_anno.display=false
            css.signin.display=false
        },
        open_signin_window(){
            css.black_block.display=true
            css.signin.display=true
        },
        change_tab(key){
            this.sub_tab=key
            for(let idx in this.subnav){
                idx==key?subnav[idx].state=true:subnav[idx].state=false        
            }
        },
        mail_login(){
            location.href='./signout.html'
        },
        go_home(){
            location.href='./index.html'
        },
        go_po(){
            location.href='./po.html'
        },
        rndbg(x){
            return {"background-image":'url('+this.photo_list[x].src+')'}
            // return {"background-image":'url(https://picsum.photos/960/500)'}
        }
    }
})




